app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "salam"], ["user_id", 1], ["created_at", 2017-02-06 18:17:29 UTC], ["updated_at", 2017-02-06 18:17:29 UTC]]
---
  def create
    message = current_user.messages.build(message_params)
    if message.save